import "gbuftools.i";
import "brdftools.i";
import "deftools.i";
import "fwdtools.i";
import "skintools.i";
///////////////////////////////////////////////////////////////
// Interfaces
///////////////////////////////////////////////////////////////
uniform_set ub_vtx {
  mat4 m;
  mat4 v;
  mat4 mv;
  mat4 vp;
  mat4 v_l;
  mat4 v_r;
  mat4 vp_l;
  mat4 vp_r;
  mat4 inv_vp;
  mat4 inv_vp_l;
  mat4 inv_vp_r;
  mat4 mvp;
  mat4 mvp_l;
  mat4 mvp_r;
  mat3 mrot;
  vec4 modcolor;
  vec2 InvViewportSize; // inverse target size
  sampler2D InstanceMatrices;
  sampler2D InstanceColors;
  usampler2D InstanceIds;
}
///////////////////////////////////////////////////////////////
uniform_set ub_frg {

  sampler2DArray CNMREA; // 4
  sampler2D EmissiveMap;

  samplerCube reflectionPROBE;
  samplerCube irradiancePROBE;
  vec4 BaseColor;
  vec4 ModColor;
  uint obj_pickID;
  mat4 v;
  vec2 InvViewportSize; // inverse target size
  float MetallicFactor;
  float RoughnessFactor;
  float RoughnessPower;
  vec3 EyePostion;
  vec4 AuxA;
  vec4 AuxB;
}

uniform_set ub_frg_fwd {

  vec4 BaseColor;

  sampler2D SSAOMap;      // 0
  sampler2D SSAOKernel;   // 1
  sampler2D SSAOScrNoise; // 2

  sampler2D MapBrdfIntegration; // 3
  sampler2D MapSpecularEnv;     // 4
  sampler2D MapDiffuseEnv;      // 5
  sampler2D MapDepth;           // 6
  sampler2D MapLinearDepth;     // 7

  sampler2D light_cookie0; // 8
  sampler2D light_cookie1; // 9
  sampler2D light_cookie2; // 10
  sampler2D light_cookie3; // 11
  sampler2D light_cookie4; // 12
  sampler2D light_cookie5; // 13
  sampler2D light_cookie6; // 14
  sampler2D light_cookie7; // 15

  samplerCube reflectionPROBE; // 16
  samplerCube irradiancePROBE; // 17

  sampler2DArray CNMREA; // 18

  //

  mat4 m;
  mat4 vp;
  mat4 v_l;
  mat4 v_r;
  mat4 vp_l;
  mat4 vp_r;
  mat4 inv_vp;
  mat4 inv_mvp;
  mat4 inv_vp_l;
  mat4 inv_vp_r;

  float SkyboxLevel;
  float SpecularLevel;
  float DiffuseLevel;
  vec3 AmbientLevel;

  float MetallicFactor;
  float RoughnessFactor;
  float RoughnessPower;

  float SSAOPower;
  float SSAOWeight;
  float SSAORadius;
  float SSAOBias;
  int SSAONumSteps;
  int SSAONumSamples;

  float DepthFogDistance;
  float DepthFogPower;
  vec4 ShadowParams;

  float SpecularMipBias;

  float EnvironmentMipBias;
  float EnvironmentMipScale;
  vec2 Zndc2eye;
  mat4 MatP;
  mat4 MatInvP;

  int point_light_count;
  int spot_light_count;
  // sampler2D UnTexPointLightsData;

  // sampler2D light_cookies[8];

  vec4 ModColor;
  vec4 AuxA;
  vec4 AuxB;
  uint obj_pickID;
  vec2 InvViewportSize; // inverse target size
  vec3 EyePostion;
  vec3 EyePostionL;
  vec3 EyePostionR;
}
